
# Используем официальный образ Node.js
FROM node:16

# Устанавливаем рабочую директорию
WORKDIR /app

# Копируем package.json и package-lock.json (для быстрой сборки кеша зависимостей)
COPY package*.json ./

# Устанавливаем зависимости
RUN npm install

# Копируем все файлы проекта в контейнер
COPY . .

# Собираем проект для продакшн-среды
RUN npm run build

# Устанавливаем веб-сервер для обслуживания статических файлов
RUN npm install -g serve

# Открываем порт
EXPOSE 3000

# Запускаем сервер для обслуживания статики
CMD ["serve", "-s", "build", "-l", "3000"]
